RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/hpm_sysctl_regs.h
/*
 * RESET_FLAG (RW)
 *
 * CPU0 reset flag, indicate a reset event got active, write 1 to clear this bit
 * 0: CPU0 reset not happened
 * 1: CPU0 reset happened
 */
#define SYSCTL_CPU_LP_RESET_FLAG_MASK (0x100U)
#define SYSCTL_CPU_LP_RESET_FLAG_SHIFT (8U)
#define SYSCTL_CPU_LP_RESET_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_RESET_FLAG_SHIFT) & SYSCTL_CPU_LP_RESET_FLAG_MASK)
#define SYSCTL_CPU_LP_RESET_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_RESET_FLAG_MASK) >> SYSCTL_CPU_LP_RESET_FLAG_SHIFT)

/*
 * MODE (RW)
 *
 * Low power mode, system behavior after WFI
 * 00: CPU clock stop after WFI
 * 01: System enter low power mode after WFI
 * 10: Keep running after WFI
 * 11: reserved
 */
#define SYSCTL_CPU_LP_MODE_MASK (0x3U)
#define SYSCTL_CPU_LP_MODE_SHIFT (0U)
#define SYSCTL_CPU_LP_MODE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_MODE_SHIFT) & SYSCTL_CPU_LP_MODE_MASK)
#define SYSCTL_CPU_LP_MODE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_MODE_MASK) >> SYSCTL_CPU_LP_MODE_SHIFT)

/* Bitfield definition for register of struct array CPU: LOCK */
/*
 * GPR (RW)
 *
 * Lock bit for CPU_DATA0 to CPU_DATA13, once set, this bit will not clear untile next reset
 */
#define SYSCTL_CPU_LOCK_GPR_MASK (0xFFFCU)
#define SYSCTL_CPU_LOCK_GPR_SHIFT (2U)
#define SYSCTL_CPU_LOCK_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_GPR_SHIFT) & SYSCTL_CPU_LOCK_GPR_MASK)
#define SYSCTL_CPU_LOCK_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_GPR_MASK) >> SYSCTL_CPU_LOCK_GPR_SHIFT)

/*
 * LOCK (RW)
 *
 * Lock bit for CPU_LOCK
 */
#define SYSCTL_CPU_LOCK_LOCK_MASK (0x2U)
#define SYSCTL_CPU_LOCK_LOCK_SHIFT (1U)
#define SYSCTL_CPU_LOCK_LOCK_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_LOCK_SHIFT) & SYSCTL_CPU_LOCK_LOCK_MASK)
#define SYSCTL_CPU_LOCK_LOCK_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_LOCK_MASK) >> SYSCTL_CPU_LOCK_LOCK_SHIFT)

/* Bitfield definition for register of struct array CPU: GPR0 */
/*
 * GPR (RW)
 *
 * register for software to handle resume, can save resume address or status
 */
#define SYSCTL_GPR_GPR_MASK (0xFFFFFFFFUL)
#define SYSCTL_GPR_GPR_SHIFT (0U)
#define SYSCTL_GPR_GPR_SET(x) (((uint32_t)(x) << SYSCTL_GPR_GPR_SHIFT) & SYSCTL_GPR_GPR_MASK)
#define SYSCTL_GPR_GPR_GET(x) (((uint32_t)(x) & SYSCTL_GPR_GPR_MASK) >> SYSCTL_GPR_GPR_SHIFT)

/* Bitfield definition for register of struct array CPU: STATUS0 */
/*
 * STATUS (RO)
 *
 * IRQ values
 */
#define SYSCTL_WAKEUP_STATUS_STATUS_MASK (0xFFFFFFFFUL)
#define SYSCTL_WAKEUP_STATUS_STATUS_SHIFT (0U)
#define SYSCTL_WAKEUP_STATUS_STATUS_GET(x) (((uint32_t)(x) & SYSCTL_WAKEUP_STATUS_STATUS_MASK) >> SYSCTL_WAKEUP_STATUS_STATUS_SHIFT)

/* Bitfield definition for register of struct array CPU: ENABLE0 */
/*
 * ENABLE (RW)
 *
 * IRQ wakeup enable
 */
#define SYSCTL_WAKEUP_ENABLE_ENABLE_MASK (0xFFFFFFFFUL)
#define SYSCTL_WAKEUP_ENABLE_ENABLE_SHIFT (0U)
#define SYSCTL_WAKEUP_ENABLE_ENABLE_SET(x) (((uint32_t)(x) << SYSCTL_WAKEUP_ENABLE_ENABLE_SHIFT) & SYSCTL_WAKEUP_ENABLE_ENABLE_MASK)
#define SYSCTL_WAKEUP_ENABLE_ENABLE_GET(x) (((uint32_t)(x) & SYSCTL_WAKEUP_ENABLE_ENABLE_MASK) >> SYSCTL_WAKEUP_ENABLE_ENABLE_SHIFT)



/* RESOURCE register group index macro definition */
#define SYSCTL_RESOURCE_CPU0 (0UL)
#define SYSCTL_RESOURCE_CPX0 (1UL)
#define SYSCTL_RESOURCE_POW_CPU0 (21UL)
#define SYSCTL_RESOURCE_RST_SOC (22UL)
#define SYSCTL_RESOURCE_RST_CPU0 (23UL)
#define SYSCTL_RESOURCE_CLK_SRC_XTAL (32UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0 (33UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL0 (34UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL0 (35UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK2_PLL0 (36UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1 (37UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL1 (38UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL1 (39UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2 (40UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL2 (41UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL2 (42UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0_REF (43UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1_REF (44UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2_REF (45UL)
#define SYSCTL_RESOURCE_CLK_TOP_CPU0 (64UL)
#define SYSCTL_RESOURCE_CLK_TOP_MCT0 (65UL)
#define SYSCTL_RESOURCE_CLK_TOP_DRAM (66UL)
#define SYSCTL_RESOURCE_CLK_TOP_XPI0 (67UL)
#define SYSCTL_RESOURCE_CLK_TOP_XPI1 (68UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR0 (69UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR1 (70UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR2 (71UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR3 (72UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT0 (73UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT1 (74UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT2 (75UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT3 (76UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT4 (77UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT5 (78UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT6 (79UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT7 (80UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C0 (81UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C1 (82UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C2 (83UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C3 (84UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI0 (85UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI1 (86UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI2 (87UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI3 (88UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN0 (89UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN1 (90UL)
#define SYSCTL_RESOURCE_CLK_TOP_PTPC (91UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA0 (92UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA1 (93UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA2 (94UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA3 (95UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD0 (96UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD1 (97UL)
#define SYSCTL_RESOURCE_CLK_TOP_ETH0 (98UL)
#define SYSCTL_RESOURCE_CLK_TOP_PTP0 (99UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF0 (100UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF1 (101UL)
#define SYSCTL_RESOURCE_CLK_TOP_NTM0 (102UL)
#define SYSCTL_RESOURCE_CLK_TOP_SDC0 (103UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC0 (128UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC1 (129UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC2 (130UL)
#define SYSCTL_RESOURCE_CLK_TOP_DAC0 (131UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S0 (132UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S1 (133UL)
#define SYSCTL_RESOURCE_AHBP (256UL)
#define SYSCTL_RESOURCE_AXIS (257UL)
#define SYSCTL_RESOURCE_AXIC (258UL)
#define SYSCTL_RESOURCE_DRAM (259UL)
#define SYSCTL_RESOURCE_ROM0 (260UL)
#define SYSCTL_RESOURCE_LMM0 (261UL)
#define SYSCTL_RESOURCE_RAM0 (262UL)
#define SYSCTL_RESOURCE_MCT0 (263UL)
#define SYSCTL_RESOURCE_XPI0 (264UL)
#define SYSCTL_RESOURCE_XPI1 (265UL)
#define SYSCTL_RESOURCE_SDP0 (266UL)
#define SYSCTL_RESOURCE_RNG0 (267UL)
#define SYSCTL_RESOURCE_KMAN (268UL)
#define SYSCTL_RESOURCE_DMA0 (269UL)
#define SYSCTL_RESOURCE_DMA1 (270UL)
#define SYSCTL_RESOURCE_FFA0 (271UL)
#define SYSCTL_RESOURCE_GPIO (272UL)
#define SYSCTL_RESOURCE_MBX0 (273UL)
#define SYSCTL_RESOURCE_WDG0 (274UL)
#define SYSCTL_RESOURCE_WDG1 (275UL)
#define SYSCTL_RESOURCE_TSNS (276UL)
#define SYSCTL_RESOURCE_TMR0 (277UL)
#define SYSCTL_RESOURCE_TMR1 (278UL)
#define SYSCTL_RESOURCE_TMR2 (279UL)
#define SYSCTL_RESOURCE_TMR3 (280UL)
#define SYSCTL_RESOURCE_URT0 (281UL)
#define SYSCTL_RESOURCE_URT1 (282UL)
#define SYSCTL_RESOURCE_URT2 (283UL)
#define SYSCTL_RESOURCE_URT3 (284UL)
#define SYSCTL_RESOURCE_URT4 (285UL)
#define SYSCTL_RESOURCE_URT5 (286UL)
#define SYSCTL_RESOURCE_URT6 (287UL)
#define SYSCTL_RESOURCE_URT7 (288UL)
#define SYSCTL_RESOURCE_I2C0 (289UL)
#define SYSCTL_RESOURCE_I2C1 (290UL)
#define SYSCTL_RESOURCE_I2C2 (291UL)
#define SYSCTL_RESOURCE_I2C3 (292UL)
#define SYSCTL_RESOURCE_SPI0 (293UL)
#define SYSCTL_RESOURCE_SPI1 (294UL)
#define SYSCTL_RESOURCE_SPI2 (295UL)
#define SYSCTL_RESOURCE_SPI3 (296UL)
#define SYSCTL_RESOURCE_CAN0 (297UL)
#define SYSCTL_RESOURCE_CAN1 (298UL)
#define SYSCTL_RESOURCE_PTPC (299UL)
#define SYSCTL_RESOURCE_ADC0 (300UL)
#define SYSCTL_RESOURCE_ADC1 (301UL)
#define SYSCTL_RESOURCE_ADC2 (302UL)
#define SYSCTL_RESOURCE_DAC0 (303UL)
#define SYSCTL_RESOURCE_ACMP (304UL)
#define SYSCTL_RESOURCE_I2S0 (305UL)
#define SYSCTL_RESOURCE_I2S1 (306UL)
#define SYSCTL_RESOURCE_PDM0 (307UL)
#define SYSCTL_RESOURCE_DAO (308UL)
#define SYSCTL_RESOURCE_MSYN (309UL)
#define SYSCTL_RESOURCE_MOT0 (310UL)
#define SYSCTL_RESOURCE_MOT1 (311UL)
#define SYSCTL_RESOURCE_ETH0 (312UL)
#define SYSCTL_RESOURCE_NTM0 (313UL)
#define SYSCTL_RESOURCE_SDC0 (314UL)
#define SYSCTL_RESOURCE_USB0 (315UL)
#define SYSCTL_RESOURCE_REF0 (316UL)
#define SYSCTL_RESOURCE_REF1 (317UL)

/* GROUP0 register group index macro definition */
#define SYSCTL_GROUP0_LINK0 (0UL)
#define SYSCTL_GROUP0_LINK1 (1UL)

/* AFFILIATE register group index macro definition */
#define SYSCTL_AFFILIATE_CPU0 (0UL)

